In [2]:
import pandas as pd
import numpy as np

### Finding datatypes

In [3]:
my_series = pd.Series([5,8,2,11,9])
print(my_series.dtype)

int64

### Converting to list

In [4]:
print(my_series.to_list())

[5, 8, 2, 11, 9]

### Empty dataframe

In [5]:
my_df = pd.DataFrame()
print(my_df)

Empty DataFrame
Columns: []
Index: []

### 1.Dataframe using list of lists

In [7]:
scores = [['Maths',90],['eng',95],['his',75]]
my_df = pd.DataFrame(scores,columns=['sub','score'])
my_df

     sub  score
0  Maths     90
1    eng     95
2    his     75

### 2.Dataframe using dictionaries

In [9]:
scores ={'subject':['maths','eng','his'],'score':[90,95,75]}
my_df=pd.DataFrame(scores)
my_df

  subject  score
0   maths     90
1     eng     95
2     his     75

### 3.Dataframe using list of dictionaries

In [10]:
scores =[{'sub':'maths','score':90},{'sub':'eng','score':95},{'sub':'his','score':75}]
my_df=pd.DataFrame(scores)
my_df

     sub  score
0  maths     90
1    eng     95
2    his     75

### 4.Dataframe using list of dictionaries with null items

In [11]:
scores=[{'sub':'maths','score':90},{'sub':'eng'},{'score':75}]
my_df=pd.DataFrame(scores)
my_df

     sub  score
0  maths   90.0
1    eng    NaN
2    NaN   75.0